Revit 2024 API
ParameterTypeId.FamilyElemSubcategory Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FamilyElemSubcategory { get; }
Visual Basic
Public Shared ReadOnly Property FamilyElemSubcategory As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FamilyElemSubcategory {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace